solvers/freeFallingPimpleFoam/tutorials/steelBallRun/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// The sphere is stationary in the body-fixed (falling) frame.
// No mesh motion is required — freeFallingPimpleFoam handles the kinematics
// via the pseudo-force body term and the fallingFrameInletVelocity BC.

dynamicFvMesh   staticFvMesh;

// ************************************************************************* //
